posts/2015-09-07-2015-09-06-called-church-prayer.org
#+date: <2015-09-07>
#+filetags: prayer religion
#+title: Hiding in Gods Own Sanctuary

"Where are you?"

The sound of heartbreak\\
rang through the garden\\
as the Lord went out\\
in the cool of the evening\\
to meet his children,\\
who hid in the place\\
that he gave them,\\
a place made for\\
fellowship with God.

God still calls,\\
and we still hide,\\
in places built for\\
communion with him,\\
masking our shame and fear\\
by doing the good while\\
failing to hear his call\\
to something great.

Father, forgive us.

/Amen/
