docs/posts/2015-09-07-2015-09-06-called-church-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 31, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hiding in Gods Own Sanctuary</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Hiding in Gods Own Sanctuary</h1>
<p class="subtitle" role="doc-subtitle">Sep 07, 2015</p>
</header><p>
&ldquo;Where are you?&rdquo;
</p>

<p>
The sound of heartbreak<br>
rang through the garden<br>
as the Lord went out<br>
in the cool of the evening<br>
to meet his children,<br>
who hid in the place<br>
that he gave them,<br>
a place made for<br>
fellowship with God.
</p>

<p>
God still calls,<br>
and we still hide,<br>
in places built for<br>
communion with him,<br>
masking our shame and fear<br>
by doing the good while<br>
failing to hear his call<br>
to something great.
</p>

<p>
Father, forgive us.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org58241fe">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 31, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
